# Определение базового образа для сборки приложения
FROM golang:1.23-alpine AS builder

# Копирование исходного кода в рабочую директорию контейнера
COPY . $GOPATH/src/app

# Установка рабочей директории
WORKDIR $GOPATH/src/app

# Получение зависимостей
RUN go get -d -v

# Сборка приложения
RUN  go build -o $GOPATH/src/app/app.bin

# Определение конечного образа для работы приложения
FROM alpine

# Установка переменной окружения TZ для установки часового пояса
ENV TZ Europe/Moscow

# Копирование исполняемого файла приложения из образа сборки в конечный образ
COPY --from=builder /go/src/app/app.bin /app.bin

# Открытие портов для взаимодействия с приложением
EXPOSE 8443/tcp
EXPOSE 1812/udp

# Определение точки входа для выполнения приложения при запуске контейнера
CMD ["/app.bin"]
